/* automatically generated by rust-bindgen 0.69.5 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const S390_FAC_EIMM: u32 = 21;
pub const S390_FAC_HFPUNX: u32 = 23;
pub const S390_FAC_ETF2: u32 = 24;
pub const S390_FAC_STCKF: u32 = 25;
pub const S390_FAC_PENH: u32 = 26;
pub const S390_FAC_ETF3: u32 = 30;
pub const S390_FAC_XCPUT: u32 = 31;
pub const S390_FAC_GIE: u32 = 34;
pub const S390_FAC_EXEXT: u32 = 35;
pub const S390_FAC_FPEXT: u32 = 37;
pub const S390_FAC_FPSE: u32 = 41;
pub const S390_FAC_DFP: u32 = 42;
pub const S390_FAC_PFPO: u32 = 44;
pub const S390_FAC_HIGHW: u32 = 45;
pub const S390_FAC_LSC: u32 = 45;
pub const S390_FAC_DFPZC: u32 = 48;
pub const S390_FAC_MISC: u32 = 49;
pub const S390_FAC_CTREXE: u32 = 50;
pub const S390_FAC_LSC2: u32 = 53;
pub const S390_FAC_MSA5: u32 = 57;
pub const S390_FAC_MI2: u32 = 58;
pub const S390_FAC_TREXE: u32 = 73;
pub const S390_FAC_MSA4: u32 = 77;
pub const S390_FAC_VX: u32 = 129;
pub const S390_FAC_VXE: u32 = 135;
pub const S390_FAC_VXE2: u32 = 148;
pub const S390_FAC_DFLT: u32 = 151;
pub const S390_NUM_GPRPARMS: u32 = 5;
pub const S390_NUM_FACILITY_DW: u32 = 3;
pub const VEX_TRC_JMP_INVALICACHE: u32 = 61;
pub const VEX_TRC_JMP_FLUSHDCACHE: u32 = 103;
pub const VEX_TRC_JMP_NOREDIR: u32 = 81;
pub const VEX_TRC_JMP_SIGTRAP: u32 = 85;
pub const VEX_TRC_JMP_SIGSEGV: u32 = 87;
pub const VEX_TRC_JMP_SIGBUS: u32 = 93;
pub const VEX_TRC_JMP_SIGFPE: u32 = 105;
pub const VEX_TRC_JMP_SIGFPE_INTDIV: u32 = 97;
pub const VEX_TRC_JMP_SIGFPE_INTOVF: u32 = 99;
pub const VEX_TRC_JMP_SIGILL: u32 = 101;
pub const VEX_TRC_JMP_EMWARN: u32 = 63;
pub const VEX_TRC_JMP_EMFAIL: u32 = 83;
pub const VEX_TRC_JMP_CLIENTREQ: u32 = 65;
pub const VEX_TRC_JMP_YIELD: u32 = 67;
pub const VEX_TRC_JMP_NODECODE: u32 = 69;
pub const VEX_TRC_JMP_MAPFAIL: u32 = 71;
pub const VEX_TRC_JMP_SYS_SYSCALL: u32 = 73;
pub const VEX_TRC_JMP_SYS_INT32: u32 = 75;
pub const VEX_TRC_JMP_SYS_INT128: u32 = 77;
pub const VEX_TRC_JMP_SYS_INT129: u32 = 89;
pub const VEX_TRC_JMP_SYS_INT130: u32 = 91;
pub const VEX_TRC_JMP_SYS_INT145: u32 = 111;
pub const VEX_TRC_JMP_SYS_INT210: u32 = 113;
pub const VEX_TRC_JMP_SYS_SYSENTER: u32 = 79;
pub const VEX_TRC_JMP_BORING: u32 = 95;
pub type UChar = ::std::os::raw::c_uchar;
pub type Char = ::std::os::raw::c_schar;
pub type HChar = ::std::os::raw::c_char;
pub type UShort = ::std::os::raw::c_ushort;
pub type Short = ::std::os::raw::c_short;
pub type UInt = ::std::os::raw::c_uint;
pub type Int = ::std::os::raw::c_int;
pub type ULong = ::std::os::raw::c_ulonglong;
pub type Long = ::std::os::raw::c_longlong;
pub type SizeT = ::std::os::raw::c_ulong;
pub type U128 = [UInt; 4usize];
pub type U256 = [UInt; 8usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub union V128 {
    pub w8: [UChar; 16usize],
    pub w16: [UShort; 8usize],
    pub w32: [UInt; 4usize],
    pub w64: [ULong; 2usize],
}
#[test]
fn bindgen_test_layout_V128() {
    const UNINIT: ::std::mem::MaybeUninit<V128> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<V128>(),
        16usize,
        concat!("Size of: ", stringify!(V128))
    );
    assert_eq!(
        ::std::mem::align_of::<V128>(),
        8usize,
        concat!("Alignment of ", stringify!(V128))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w8) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V128), "::", stringify!(w8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w16) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V128), "::", stringify!(w16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w32) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V128), "::", stringify!(w32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w64) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V128), "::", stringify!(w64))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union V256 {
    pub w8: [UChar; 32usize],
    pub w16: [UShort; 16usize],
    pub w32: [UInt; 8usize],
    pub w64: [ULong; 4usize],
}
#[test]
fn bindgen_test_layout_V256() {
    const UNINIT: ::std::mem::MaybeUninit<V256> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<V256>(),
        32usize,
        concat!("Size of: ", stringify!(V256))
    );
    assert_eq!(
        ::std::mem::align_of::<V256>(),
        8usize,
        concat!("Alignment of ", stringify!(V256))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w8) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V256), "::", stringify!(w8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w16) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V256), "::", stringify!(w16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w32) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V256), "::", stringify!(w32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w64) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(V256), "::", stringify!(w64))
    );
}
pub type Float = f32;
pub type Double = f64;
pub type Bool = ::std::os::raw::c_uchar;
pub type Addr32 = UInt;
pub type Addr64 = ULong;
pub type Addr = ::std::os::raw::c_ulong;
pub type HWord = ::std::os::raw::c_ulong;
pub type RegWord = HWord;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum VexEmNote {
    EmNote_NONE = 0,
    EmWarn_X86_x87exns = 1,
    EmWarn_X86_x87precision = 2,
    EmWarn_X86_sseExns = 3,
    EmWarn_X86_fz = 4,
    EmWarn_X86_daz = 5,
    EmWarn_X86_acFlag = 6,
    EmWarn_PPCexns = 7,
    EmWarn_PPC64_redir_overflow = 8,
    EmWarn_PPC64_redir_underflow = 9,
    EmWarn_S390X_fpext_rounding = 10,
    EmWarn_S390X_invalid_rounding = 11,
    EmFail_S390X_stfle = 12,
    EmFail_S390X_stckf = 13,
    EmFail_S390X_ecag = 14,
    EmFail_S390X_pfpo = 15,
    EmFail_S390X_DFP_insn = 16,
    EmFail_S390X_fpext = 17,
    EmFail_S390X_invalid_PFPO_rounding_mode = 18,
    EmFail_S390X_invalid_PFPO_function = 19,
    EmFail_S390X_vx = 20,
    EmFail_S390X_ppno = 21,
    EmFail_S390X_vxe = 22,
    EmNote_NUMBER = 23,
}
extern "C" {
    pub fn LibVEX_EmNote_string(arg1: VexEmNote) -> *const HChar;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VexGuestAMD64State {
    pub host_EvC_FAILADDR: ULong,
    pub host_EvC_COUNTER: UInt,
    pub pad0: UInt,
    pub guest_RAX: ULong,
    pub guest_RCX: ULong,
    pub guest_RDX: ULong,
    pub guest_RBX: ULong,
    pub guest_RSP: ULong,
    pub guest_RBP: ULong,
    pub guest_RSI: ULong,
    pub guest_RDI: ULong,
    pub guest_R8: ULong,
    pub guest_R9: ULong,
    pub guest_R10: ULong,
    pub guest_R11: ULong,
    pub guest_R12: ULong,
    pub guest_R13: ULong,
    pub guest_R14: ULong,
    pub guest_R15: ULong,
    pub guest_CC_OP: ULong,
    pub guest_CC_DEP1: ULong,
    pub guest_CC_DEP2: ULong,
    pub guest_CC_NDEP: ULong,
    pub guest_DFLAG: ULong,
    pub guest_RIP: ULong,
    pub guest_ACFLAG: ULong,
    pub guest_IDFLAG: ULong,
    pub guest_FS_CONST: ULong,
    pub guest_SSEROUND: ULong,
    pub guest_YMM0: U256,
    pub guest_YMM1: U256,
    pub guest_YMM2: U256,
    pub guest_YMM3: U256,
    pub guest_YMM4: U256,
    pub guest_YMM5: U256,
    pub guest_YMM6: U256,
    pub guest_YMM7: U256,
    pub guest_YMM8: U256,
    pub guest_YMM9: U256,
    pub guest_YMM10: U256,
    pub guest_YMM11: U256,
    pub guest_YMM12: U256,
    pub guest_YMM13: U256,
    pub guest_YMM14: U256,
    pub guest_YMM15: U256,
    pub guest_YMM16: U256,
    pub guest_FTOP: UInt,
    pub pad1: UInt,
    pub guest_FPREG: [ULong; 8usize],
    pub guest_FPTAG: [UChar; 8usize],
    pub guest_FPROUND: ULong,
    pub guest_FC3210: ULong,
    pub guest_EMNOTE: UInt,
    pub pad2: UInt,
    pub guest_CMSTART: ULong,
    pub guest_CMLEN: ULong,
    pub guest_NRADDR: ULong,
    pub guest_SC_CLASS: ULong,
    pub guest_GS_CONST: ULong,
    pub guest_IP_AT_SYSCALL: ULong,
    pub pad3: ULong,
}
#[test]
fn bindgen_test_layout_VexGuestAMD64State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestAMD64State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestAMD64State>(),
        928usize,
        concat!("Size of: ", stringify!(VexGuestAMD64State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestAMD64State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestAMD64State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RAX) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RAX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RCX) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RCX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RDX) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RDX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RBX) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RBX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RSP) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RSP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RBP) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RBP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RSI) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RSI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RDI) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RDI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R8) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R9) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R10) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R11) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R12) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R13) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R14) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R15) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_R15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_OP) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_CC_OP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP1) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_CC_DEP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP2) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_CC_DEP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_NDEP) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_CC_NDEP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_DFLAG) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_DFLAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_RIP) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_RIP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACFLAG) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_ACFLAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IDFLAG) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_IDFLAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FS_CONST) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_FS_CONST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_SSEROUND) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_SSEROUND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM0) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM1) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM2) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM3) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM4) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM5) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM6) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM7) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM8) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM9) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM10) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM11) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM12) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM13) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM14) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM15) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_YMM16) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_YMM16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FTOP) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_FTOP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad1) as usize - ptr as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPREG) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_FPREG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPTAG) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_FPTAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPROUND) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_FPROUND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FC3210) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_FC3210)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad2) as usize - ptr as usize },
        868usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_SC_CLASS) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_SC_CLASS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GS_CONST) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_GS_CONST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IP_AT_SYSCALL) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(guest_IP_AT_SYSCALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad3) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestAMD64State),
            "::",
            stringify!(pad3)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestAMD64_initialise(vex_state: *mut VexGuestAMD64State);
}
extern "C" {
    pub fn LibVEX_GuestAMD64_get_rflags(vex_state: *const VexGuestAMD64State) -> ULong;
}
extern "C" {
    pub fn LibVEX_GuestAMD64_put_rflags(rflags: ULong, vex_state: *mut VexGuestAMD64State);
}
extern "C" {
    pub fn LibVEX_GuestAMD64_put_rflag_c(new_carry_flag: ULong, vex_state: *mut VexGuestAMD64State);
}
extern "C" {
    pub fn LibVEX_GuestAMD64_fxsave(gst: *mut VexGuestAMD64State, fp_state: HWord);
}
extern "C" {
    pub fn LibVEX_GuestAMD64_fxrstor(fp_state: HWord, gst: *mut VexGuestAMD64State) -> VexEmNote;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VexGuestARM64State {
    pub host_EvC_FAILADDR: ULong,
    pub host_EvC_COUNTER: UInt,
    pub pad0: UInt,
    pub guest_X0: ULong,
    pub guest_X1: ULong,
    pub guest_X2: ULong,
    pub guest_X3: ULong,
    pub guest_X4: ULong,
    pub guest_X5: ULong,
    pub guest_X6: ULong,
    pub guest_X7: ULong,
    pub guest_X8: ULong,
    pub guest_X9: ULong,
    pub guest_X10: ULong,
    pub guest_X11: ULong,
    pub guest_X12: ULong,
    pub guest_X13: ULong,
    pub guest_X14: ULong,
    pub guest_X15: ULong,
    pub guest_X16: ULong,
    pub guest_X17: ULong,
    pub guest_X18: ULong,
    pub guest_X19: ULong,
    pub guest_X20: ULong,
    pub guest_X21: ULong,
    pub guest_X22: ULong,
    pub guest_X23: ULong,
    pub guest_X24: ULong,
    pub guest_X25: ULong,
    pub guest_X26: ULong,
    pub guest_X27: ULong,
    pub guest_X28: ULong,
    pub guest_X29: ULong,
    pub guest_X30: ULong,
    pub guest_XSP: ULong,
    pub guest_PC: ULong,
    pub guest_CC_OP: ULong,
    pub guest_CC_DEP1: ULong,
    pub guest_CC_DEP2: ULong,
    pub guest_CC_NDEP: ULong,
    pub guest_TPIDR_EL0: ULong,
    pub guest_Q0: U128,
    pub guest_Q1: U128,
    pub guest_Q2: U128,
    pub guest_Q3: U128,
    pub guest_Q4: U128,
    pub guest_Q5: U128,
    pub guest_Q6: U128,
    pub guest_Q7: U128,
    pub guest_Q8: U128,
    pub guest_Q9: U128,
    pub guest_Q10: U128,
    pub guest_Q11: U128,
    pub guest_Q12: U128,
    pub guest_Q13: U128,
    pub guest_Q14: U128,
    pub guest_Q15: U128,
    pub guest_Q16: U128,
    pub guest_Q17: U128,
    pub guest_Q18: U128,
    pub guest_Q19: U128,
    pub guest_Q20: U128,
    pub guest_Q21: U128,
    pub guest_Q22: U128,
    pub guest_Q23: U128,
    pub guest_Q24: U128,
    pub guest_Q25: U128,
    pub guest_Q26: U128,
    pub guest_Q27: U128,
    pub guest_Q28: U128,
    pub guest_Q29: U128,
    pub guest_Q30: U128,
    pub guest_Q31: U128,
    pub guest_QCFLAG: U128,
    pub guest_EMNOTE: UInt,
    pub guest_CMSTART: ULong,
    pub guest_CMLEN: ULong,
    pub guest_NRADDR: ULong,
    pub guest_IP_AT_SYSCALL: ULong,
    pub guest_FPCR: UInt,
    pub guest_LLSC_SIZE: ULong,
    pub guest_LLSC_ADDR: ULong,
    pub guest_LLSC_DATA: ULong,
    pub pad_end_1: ULong,
}
#[test]
fn bindgen_test_layout_VexGuestARM64State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestARM64State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestARM64State>(),
        928usize,
        concat!("Size of: ", stringify!(VexGuestARM64State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestARM64State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestARM64State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X3) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X4) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X5) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X6) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X7) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X8) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X9) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X10) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X11) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X12) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X13) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X14) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X15) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X16) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X17) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X18) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X19) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X20) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X21) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X22) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X23) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X24) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X25) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X26) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X27) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X28) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X29) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_X30) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_X30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XSP) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_XSP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PC) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_PC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_OP) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_CC_OP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP1) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_CC_DEP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP2) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_CC_DEP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_NDEP) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_CC_NDEP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TPIDR_EL0) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_TPIDR_EL0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q0) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q1) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q2) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q3) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q4) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q5) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q6) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q7) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q8) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q9) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q10) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q11) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q12) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q13) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q14) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q15) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q16) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q17) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q18) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q19) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q20) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q21) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q22) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q23) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q24) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q25) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q26) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q27) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q28) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q29) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q30) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_Q31) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_Q31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_QCFLAG) as usize - ptr as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_QCFLAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IP_AT_SYSCALL) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_IP_AT_SYSCALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPCR) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_FPCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLSC_SIZE) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_LLSC_SIZE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLSC_ADDR) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_LLSC_ADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLSC_DATA) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(guest_LLSC_DATA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad_end_1) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARM64State),
            "::",
            stringify!(pad_end_1)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestARM64_initialise(vex_state: *mut VexGuestARM64State);
}
extern "C" {
    pub fn LibVEX_GuestARM64_get_nzcv(vex_state: *const VexGuestARM64State) -> ULong;
}
extern "C" {
    pub fn LibVEX_GuestARM64_get_fpsr(vex_state: *const VexGuestARM64State) -> ULong;
}
extern "C" {
    pub fn LibVEX_GuestARM64_set_fpsr(vex_state: *mut VexGuestARM64State, fpsr: ULong);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VexGuestARMState {
    pub host_EvC_FAILADDR: UInt,
    pub host_EvC_COUNTER: UInt,
    pub guest_R0: UInt,
    pub guest_R1: UInt,
    pub guest_R2: UInt,
    pub guest_R3: UInt,
    pub guest_R4: UInt,
    pub guest_R5: UInt,
    pub guest_R6: UInt,
    pub guest_R7: UInt,
    pub guest_R8: UInt,
    pub guest_R9: UInt,
    pub guest_R10: UInt,
    pub guest_R11: UInt,
    pub guest_R12: UInt,
    pub guest_R13: UInt,
    pub guest_R14: UInt,
    pub guest_R15T: UInt,
    pub guest_CC_OP: UInt,
    pub guest_CC_DEP1: UInt,
    pub guest_CC_DEP2: UInt,
    pub guest_CC_NDEP: UInt,
    pub guest_QFLAG32: UInt,
    pub guest_GEFLAG0: UInt,
    pub guest_GEFLAG1: UInt,
    pub guest_GEFLAG2: UInt,
    pub guest_GEFLAG3: UInt,
    pub guest_EMNOTE: UInt,
    pub guest_CMSTART: UInt,
    pub guest_CMLEN: UInt,
    pub guest_NRADDR: UInt,
    pub guest_IP_AT_SYSCALL: UInt,
    pub guest_D0: ULong,
    pub guest_D1: ULong,
    pub guest_D2: ULong,
    pub guest_D3: ULong,
    pub guest_D4: ULong,
    pub guest_D5: ULong,
    pub guest_D6: ULong,
    pub guest_D7: ULong,
    pub guest_D8: ULong,
    pub guest_D9: ULong,
    pub guest_D10: ULong,
    pub guest_D11: ULong,
    pub guest_D12: ULong,
    pub guest_D13: ULong,
    pub guest_D14: ULong,
    pub guest_D15: ULong,
    pub guest_D16: ULong,
    pub guest_D17: ULong,
    pub guest_D18: ULong,
    pub guest_D19: ULong,
    pub guest_D20: ULong,
    pub guest_D21: ULong,
    pub guest_D22: ULong,
    pub guest_D23: ULong,
    pub guest_D24: ULong,
    pub guest_D25: ULong,
    pub guest_D26: ULong,
    pub guest_D27: ULong,
    pub guest_D28: ULong,
    pub guest_D29: ULong,
    pub guest_D30: ULong,
    pub guest_D31: ULong,
    pub guest_FPSCR: UInt,
    pub guest_TPIDRURO: UInt,
    pub guest_TPIDRURW: UInt,
    pub guest_ITSTATE: UInt,
}
#[test]
fn bindgen_test_layout_VexGuestARMState() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestARMState> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestARMState>(),
        400usize,
        concat!("Size of: ", stringify!(VexGuestARMState))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestARMState>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestARMState))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R3) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R4) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R5) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R6) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R7) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R8) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R9) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R10) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R11) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R12) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R13) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R14) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_R15T) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_R15T)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_OP) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_CC_OP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP1) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_CC_DEP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP2) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_CC_DEP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_NDEP) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_CC_NDEP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_QFLAG32) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_QFLAG32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GEFLAG0) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_GEFLAG0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GEFLAG1) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_GEFLAG1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GEFLAG2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_GEFLAG2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GEFLAG3) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_GEFLAG3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IP_AT_SYSCALL) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_IP_AT_SYSCALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D0) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D1) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D2) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D3) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D4) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D5) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D6) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D7) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D8) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D9) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D10) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D11) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D12) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D13) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D14) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D15) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D16) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D17) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D18) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D19) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D20) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D21) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D22) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D23) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D24) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D25) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D26) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D27) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D28) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D29) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D30) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_D31) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_D31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPSCR) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_FPSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TPIDRURO) as usize - ptr as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_TPIDRURO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TPIDRURW) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_TPIDRURW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ITSTATE) as usize - ptr as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestARMState),
            "::",
            stringify!(guest_ITSTATE)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestARM_initialise(vex_state: *mut VexGuestARMState);
}
extern "C" {
    pub fn LibVEX_GuestARM_get_cpsr(vex_state: *const VexGuestARMState) -> UInt;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct VexGuestMIPS32State {
    pub host_EvC_FAILADDR: UInt,
    pub host_EvC_COUNTER: UInt,
    pub guest_r0: UInt,
    pub guest_r1: UInt,
    pub guest_r2: UInt,
    pub guest_r3: UInt,
    pub guest_r4: UInt,
    pub guest_r5: UInt,
    pub guest_r6: UInt,
    pub guest_r7: UInt,
    pub guest_r8: UInt,
    pub guest_r9: UInt,
    pub guest_r10: UInt,
    pub guest_r11: UInt,
    pub guest_r12: UInt,
    pub guest_r13: UInt,
    pub guest_r14: UInt,
    pub guest_r15: UInt,
    pub guest_r16: UInt,
    pub guest_r17: UInt,
    pub guest_r18: UInt,
    pub guest_r19: UInt,
    pub guest_r20: UInt,
    pub guest_r21: UInt,
    pub guest_r22: UInt,
    pub guest_r23: UInt,
    pub guest_r24: UInt,
    pub guest_r25: UInt,
    pub guest_r26: UInt,
    pub guest_r27: UInt,
    pub guest_r28: UInt,
    pub guest_r29: UInt,
    pub guest_r30: UInt,
    pub guest_r31: UInt,
    pub guest_PC: UInt,
    pub guest_HI: UInt,
    pub guest_LO: UInt,
    pub _padding1: UInt,
    pub guest_f0: ULong,
    pub guest_f1: ULong,
    pub guest_f2: ULong,
    pub guest_f3: ULong,
    pub guest_f4: ULong,
    pub guest_f5: ULong,
    pub guest_f6: ULong,
    pub guest_f7: ULong,
    pub guest_f8: ULong,
    pub guest_f9: ULong,
    pub guest_f10: ULong,
    pub guest_f11: ULong,
    pub guest_f12: ULong,
    pub guest_f13: ULong,
    pub guest_f14: ULong,
    pub guest_f15: ULong,
    pub guest_f16: ULong,
    pub guest_f17: ULong,
    pub guest_f18: ULong,
    pub guest_f19: ULong,
    pub guest_f20: ULong,
    pub guest_f21: ULong,
    pub guest_f22: ULong,
    pub guest_f23: ULong,
    pub guest_f24: ULong,
    pub guest_f25: ULong,
    pub guest_f26: ULong,
    pub guest_f27: ULong,
    pub guest_f28: ULong,
    pub guest_f29: ULong,
    pub guest_f30: ULong,
    pub guest_f31: ULong,
    pub guest_FIR: UInt,
    pub guest_FCCR: UInt,
    pub guest_FEXR: UInt,
    pub guest_FENR: UInt,
    pub guest_FCSR: UInt,
    pub guest_ULR: UInt,
    pub guest_EMNOTE: UInt,
    pub guest_CMSTART: UInt,
    pub guest_CMLEN: UInt,
    pub guest_NRADDR: UInt,
    pub guest_COND: UInt,
    pub guest_DSPControl: UInt,
    pub guest_ac0: ULong,
    pub guest_ac1: ULong,
    pub guest_ac2: ULong,
    pub guest_ac3: ULong,
    pub guest_CP0_status: UInt,
    pub guest_CP0_Config5: UInt,
    pub guest_LLaddr: UInt,
    pub guest_LLdata: UInt,
    pub guest_w0: V128,
    pub guest_w1: V128,
    pub guest_w2: V128,
    pub guest_w3: V128,
    pub guest_w4: V128,
    pub guest_w5: V128,
    pub guest_w6: V128,
    pub guest_w7: V128,
    pub guest_w8: V128,
    pub guest_w9: V128,
    pub guest_w10: V128,
    pub guest_w11: V128,
    pub guest_w12: V128,
    pub guest_w13: V128,
    pub guest_w14: V128,
    pub guest_w15: V128,
    pub guest_w16: V128,
    pub guest_w17: V128,
    pub guest_w18: V128,
    pub guest_w19: V128,
    pub guest_w20: V128,
    pub guest_w21: V128,
    pub guest_w22: V128,
    pub guest_w23: V128,
    pub guest_w24: V128,
    pub guest_w25: V128,
    pub guest_w26: V128,
    pub guest_w27: V128,
    pub guest_w28: V128,
    pub guest_w29: V128,
    pub guest_w30: V128,
    pub guest_w31: V128,
    pub guest_MSACSR: UInt,
    pub _padding3: UInt,
    pub guest_LLdata64: ULong,
    pub _padding4: ULong,
}
#[test]
fn bindgen_test_layout_VexGuestMIPS32State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestMIPS32State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestMIPS32State>(),
        1040usize,
        concat!("Size of: ", stringify!(VexGuestMIPS32State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestMIPS32State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestMIPS32State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r3) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r4) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r5) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r6) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r7) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r8) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r9) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r10) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r11) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r12) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r13) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r14) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r15) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r16) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r17) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r18) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r19) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r20) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r21) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r22) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r23) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r24) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r25) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r26) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r27) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r28) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r29) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r30) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r31) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_r31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PC) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_PC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_HI) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_HI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LO) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_LO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._padding1) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f0) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f1) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f2) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f3) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f4) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f5) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f6) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f7) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f8) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f9) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f10) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f11) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f12) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f13) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f14) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f15) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f16) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f17) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f18) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f19) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f20) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f21) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f22) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f23) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f24) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f25) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f26) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f27) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f28) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f29) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f30) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f31) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_f31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FIR) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_FIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FCCR) as usize - ptr as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_FCCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FEXR) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_FEXR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FENR) as usize - ptr as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_FENR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FCSR) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_FCSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ULR) as usize - ptr as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_ULR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        436usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_COND) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_COND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_DSPControl) as usize - ptr as usize },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_DSPControl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ac0) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_ac0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ac1) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_ac1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ac2) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_ac2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ac3) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_ac3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CP0_status) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_CP0_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CP0_Config5) as usize - ptr as usize },
        492usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_CP0_Config5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLaddr) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_LLaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLdata) as usize - ptr as usize },
        500usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_LLdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w0) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w1) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w2) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w3) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w4) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w5) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w6) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w7) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w8) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w9) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w10) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w11) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w12) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w13) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w14) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w15) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w16) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w17) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w18) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w19) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w20) as usize - ptr as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w21) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w22) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w23) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w24) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w25) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w26) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w27) as usize - ptr as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w28) as usize - ptr as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w29) as usize - ptr as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w30) as usize - ptr as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w31) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_w31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_MSACSR) as usize - ptr as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_MSACSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._padding3) as usize - ptr as usize },
        1020usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(_padding3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLdata64) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(guest_LLdata64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._padding4) as usize - ptr as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS32State),
            "::",
            stringify!(_padding4)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestMIPS32_initialise(vex_state: *mut VexGuestMIPS32State);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct VexGuestMIPS64State {
    pub host_EvC_FAILADDR: ULong,
    pub host_EvC_COUNTER: UInt,
    pub _padding1: UInt,
    pub guest_r0: ULong,
    pub guest_r1: ULong,
    pub guest_r2: ULong,
    pub guest_r3: ULong,
    pub guest_r4: ULong,
    pub guest_r5: ULong,
    pub guest_r6: ULong,
    pub guest_r7: ULong,
    pub guest_r8: ULong,
    pub guest_r9: ULong,
    pub guest_r10: ULong,
    pub guest_r11: ULong,
    pub guest_r12: ULong,
    pub guest_r13: ULong,
    pub guest_r14: ULong,
    pub guest_r15: ULong,
    pub guest_r16: ULong,
    pub guest_r17: ULong,
    pub guest_r18: ULong,
    pub guest_r19: ULong,
    pub guest_r20: ULong,
    pub guest_r21: ULong,
    pub guest_r22: ULong,
    pub guest_r23: ULong,
    pub guest_r24: ULong,
    pub guest_r25: ULong,
    pub guest_r26: ULong,
    pub guest_r27: ULong,
    pub guest_r28: ULong,
    pub guest_r29: ULong,
    pub guest_r30: ULong,
    pub guest_r31: ULong,
    pub guest_PC: ULong,
    pub guest_HI: ULong,
    pub guest_LO: ULong,
    pub guest_f0: ULong,
    pub guest_f1: ULong,
    pub guest_f2: ULong,
    pub guest_f3: ULong,
    pub guest_f4: ULong,
    pub guest_f5: ULong,
    pub guest_f6: ULong,
    pub guest_f7: ULong,
    pub guest_f8: ULong,
    pub guest_f9: ULong,
    pub guest_f10: ULong,
    pub guest_f11: ULong,
    pub guest_f12: ULong,
    pub guest_f13: ULong,
    pub guest_f14: ULong,
    pub guest_f15: ULong,
    pub guest_f16: ULong,
    pub guest_f17: ULong,
    pub guest_f18: ULong,
    pub guest_f19: ULong,
    pub guest_f20: ULong,
    pub guest_f21: ULong,
    pub guest_f22: ULong,
    pub guest_f23: ULong,
    pub guest_f24: ULong,
    pub guest_f25: ULong,
    pub guest_f26: ULong,
    pub guest_f27: ULong,
    pub guest_f28: ULong,
    pub guest_f29: ULong,
    pub guest_f30: ULong,
    pub guest_f31: ULong,
    pub guest_FIR: UInt,
    pub guest_FCCR: UInt,
    pub guest_FEXR: UInt,
    pub guest_FENR: UInt,
    pub guest_FCSR: UInt,
    pub guest_CP0_status: UInt,
    pub guest_ULR: ULong,
    pub guest_EMNOTE: UInt,
    pub guest_COND: UInt,
    pub guest_CMSTART: ULong,
    pub guest_CMLEN: ULong,
    pub guest_NRADDR: ULong,
    pub guest_LLaddr: ULong,
    pub guest_LLdata: ULong,
    pub guest_w0: V128,
    pub guest_w1: V128,
    pub guest_w2: V128,
    pub guest_w3: V128,
    pub guest_w4: V128,
    pub guest_w5: V128,
    pub guest_w6: V128,
    pub guest_w7: V128,
    pub guest_w8: V128,
    pub guest_w9: V128,
    pub guest_w10: V128,
    pub guest_w11: V128,
    pub guest_w12: V128,
    pub guest_w13: V128,
    pub guest_w14: V128,
    pub guest_w15: V128,
    pub guest_w16: V128,
    pub guest_w17: V128,
    pub guest_w18: V128,
    pub guest_w19: V128,
    pub guest_w20: V128,
    pub guest_w21: V128,
    pub guest_w22: V128,
    pub guest_w23: V128,
    pub guest_w24: V128,
    pub guest_w25: V128,
    pub guest_w26: V128,
    pub guest_w27: V128,
    pub guest_w28: V128,
    pub guest_w29: V128,
    pub guest_w30: V128,
    pub guest_w31: V128,
    pub guest_MSACSR: UInt,
    pub _padding2: UInt,
}
#[test]
fn bindgen_test_layout_VexGuestMIPS64State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestMIPS64State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestMIPS64State>(),
        1152usize,
        concat!("Size of: ", stringify!(VexGuestMIPS64State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestMIPS64State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestMIPS64State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._padding1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(_padding1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r3) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r4) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r5) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r6) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r7) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r8) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r9) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r10) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r11) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r12) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r13) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r14) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r15) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r16) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r17) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r18) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r19) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r20) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r21) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r22) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r23) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r24) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r25) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r26) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r27) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r28) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r29) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r30) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r31) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_r31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PC) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_PC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_HI) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_HI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LO) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_LO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f0) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f1) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f2) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f3) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f4) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f5) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f6) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f7) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f8) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f9) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f10) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f11) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f12) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f13) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f14) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f15) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f16) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f17) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f18) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f19) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f20) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f21) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f22) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f23) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f24) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f25) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f26) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f27) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f28) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f29) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f30) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_f31) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_f31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FIR) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_FIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FCCR) as usize - ptr as usize },
        556usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_FCCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FEXR) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_FEXR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FENR) as usize - ptr as usize },
        564usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_FENR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FCSR) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_FCSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CP0_status) as usize - ptr as usize },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_CP0_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ULR) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_ULR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_COND) as usize - ptr as usize },
        588usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_COND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLaddr) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_LLaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LLdata) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_LLdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w0) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w1) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w2) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w3) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w4) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w5) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w6) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w7) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w8) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w9) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w10) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w11) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w12) as usize - ptr as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w13) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w14) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w15) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w16) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w17) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w18) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w19) as usize - ptr as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w20) as usize - ptr as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w21) as usize - ptr as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w22) as usize - ptr as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w23) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w24) as usize - ptr as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w25) as usize - ptr as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w26) as usize - ptr as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w27) as usize - ptr as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w28) as usize - ptr as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w29) as usize - ptr as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w30) as usize - ptr as usize },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_w31) as usize - ptr as usize },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_w31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_MSACSR) as usize - ptr as usize },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(guest_MSACSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._padding2) as usize - ptr as usize },
        1148usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestMIPS64State),
            "::",
            stringify!(_padding2)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestMIPS64_initialise(vex_state: *mut VexGuestMIPS64State);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VexGuestPPC32State {
    pub host_EvC_FAILADDR: UInt,
    pub host_EvC_COUNTER: UInt,
    pub pad3: UInt,
    pub pad4: UInt,
    pub guest_GPR0: UInt,
    pub guest_GPR1: UInt,
    pub guest_GPR2: UInt,
    pub guest_GPR3: UInt,
    pub guest_GPR4: UInt,
    pub guest_GPR5: UInt,
    pub guest_GPR6: UInt,
    pub guest_GPR7: UInt,
    pub guest_GPR8: UInt,
    pub guest_GPR9: UInt,
    pub guest_GPR10: UInt,
    pub guest_GPR11: UInt,
    pub guest_GPR12: UInt,
    pub guest_GPR13: UInt,
    pub guest_GPR14: UInt,
    pub guest_GPR15: UInt,
    pub guest_GPR16: UInt,
    pub guest_GPR17: UInt,
    pub guest_GPR18: UInt,
    pub guest_GPR19: UInt,
    pub guest_GPR20: UInt,
    pub guest_GPR21: UInt,
    pub guest_GPR22: UInt,
    pub guest_GPR23: UInt,
    pub guest_GPR24: UInt,
    pub guest_GPR25: UInt,
    pub guest_GPR26: UInt,
    pub guest_GPR27: UInt,
    pub guest_GPR28: UInt,
    pub guest_GPR29: UInt,
    pub guest_GPR30: UInt,
    pub guest_GPR31: UInt,
    pub guest_VSR0: U128,
    pub guest_VSR1: U128,
    pub guest_VSR2: U128,
    pub guest_VSR3: U128,
    pub guest_VSR4: U128,
    pub guest_VSR5: U128,
    pub guest_VSR6: U128,
    pub guest_VSR7: U128,
    pub guest_VSR8: U128,
    pub guest_VSR9: U128,
    pub guest_VSR10: U128,
    pub guest_VSR11: U128,
    pub guest_VSR12: U128,
    pub guest_VSR13: U128,
    pub guest_VSR14: U128,
    pub guest_VSR15: U128,
    pub guest_VSR16: U128,
    pub guest_VSR17: U128,
    pub guest_VSR18: U128,
    pub guest_VSR19: U128,
    pub guest_VSR20: U128,
    pub guest_VSR21: U128,
    pub guest_VSR22: U128,
    pub guest_VSR23: U128,
    pub guest_VSR24: U128,
    pub guest_VSR25: U128,
    pub guest_VSR26: U128,
    pub guest_VSR27: U128,
    pub guest_VSR28: U128,
    pub guest_VSR29: U128,
    pub guest_VSR30: U128,
    pub guest_VSR31: U128,
    pub guest_VSR32: U128,
    pub guest_VSR33: U128,
    pub guest_VSR34: U128,
    pub guest_VSR35: U128,
    pub guest_VSR36: U128,
    pub guest_VSR37: U128,
    pub guest_VSR38: U128,
    pub guest_VSR39: U128,
    pub guest_VSR40: U128,
    pub guest_VSR41: U128,
    pub guest_VSR42: U128,
    pub guest_VSR43: U128,
    pub guest_VSR44: U128,
    pub guest_VSR45: U128,
    pub guest_VSR46: U128,
    pub guest_VSR47: U128,
    pub guest_VSR48: U128,
    pub guest_VSR49: U128,
    pub guest_VSR50: U128,
    pub guest_VSR51: U128,
    pub guest_VSR52: U128,
    pub guest_VSR53: U128,
    pub guest_VSR54: U128,
    pub guest_VSR55: U128,
    pub guest_VSR56: U128,
    pub guest_VSR57: U128,
    pub guest_VSR58: U128,
    pub guest_VSR59: U128,
    pub guest_VSR60: U128,
    pub guest_VSR61: U128,
    pub guest_VSR62: U128,
    pub guest_VSR63: U128,
    pub guest_CIA: UInt,
    pub guest_LR: UInt,
    pub guest_CTR: UInt,
    pub guest_XER_SO: UChar,
    pub guest_XER_OV: UChar,
    pub guest_XER_OV32: UChar,
    pub guest_XER_CA: UChar,
    pub guest_XER_CA32: UChar,
    pub guest_XER_BC: UChar,
    pub guest_CR0_321: UChar,
    pub guest_CR0_0: UChar,
    pub guest_CR1_321: UChar,
    pub guest_CR1_0: UChar,
    pub guest_CR2_321: UChar,
    pub guest_CR2_0: UChar,
    pub guest_CR3_321: UChar,
    pub guest_CR3_0: UChar,
    pub guest_CR4_321: UChar,
    pub guest_CR4_0: UChar,
    pub guest_CR5_321: UChar,
    pub guest_CR5_0: UChar,
    pub guest_CR6_321: UChar,
    pub guest_CR6_0: UChar,
    pub guest_CR7_321: UChar,
    pub guest_CR7_0: UChar,
    pub guest_FPROUND: UChar,
    pub guest_DFPROUND: UChar,
    pub guest_C_FPCC: UChar,
    pub pad0: UChar,
    pub pad1: UChar,
    pub pad2: UChar,
    pub guest_VRSAVE: UInt,
    pub guest_VSCR: UInt,
    pub guest_EMNOTE: UInt,
    pub guest_CMSTART: UInt,
    pub guest_CMLEN: UInt,
    pub guest_NRADDR: UInt,
    pub guest_NRADDR_GPR2: UInt,
    pub guest_REDIR_SP: UInt,
    pub guest_REDIR_STACK: [UInt; 32usize],
    pub guest_IP_AT_SYSCALL: UInt,
    pub guest_SPRG3_RO: UInt,
    pub padding1: UInt,
    pub guest_TFHAR: ULong,
    pub guest_TEXASR: ULong,
    pub guest_TFIAR: ULong,
    pub guest_PPR: ULong,
    pub guest_TEXASRU: UInt,
    pub guest_PSPB: UInt,
    pub guest_DSCR: ULong,
    pub guest_ACC_0_r0: U128,
    pub guest_ACC_0_r1: U128,
    pub guest_ACC_0_r2: U128,
    pub guest_ACC_0_r3: U128,
    pub guest_ACC_1_r0: U128,
    pub guest_ACC_1_r1: U128,
    pub guest_ACC_1_r2: U128,
    pub guest_ACC_1_r3: U128,
    pub guest_ACC_2_r0: U128,
    pub guest_ACC_2_r1: U128,
    pub guest_ACC_2_r2: U128,
    pub guest_ACC_2_r3: U128,
    pub guest_ACC_3_r0: U128,
    pub guest_ACC_3_r1: U128,
    pub guest_ACC_3_r2: U128,
    pub guest_ACC_3_r3: U128,
    pub guest_ACC_4_r0: U128,
    pub guest_ACC_4_r1: U128,
    pub guest_ACC_4_r2: U128,
    pub guest_ACC_4_r3: U128,
    pub guest_ACC_5_r0: U128,
    pub guest_ACC_5_r1: U128,
    pub guest_ACC_5_r2: U128,
    pub guest_ACC_5_r3: U128,
    pub guest_ACC_6_r0: U128,
    pub guest_ACC_6_r1: U128,
    pub guest_ACC_6_r2: U128,
    pub guest_ACC_6_r3: U128,
    pub guest_ACC_7_r0: U128,
    pub guest_ACC_7_r1: U128,
    pub guest_ACC_7_r2: U128,
    pub guest_ACC_7_r3: U128,
    pub padding2: UInt,
}
#[test]
fn bindgen_test_layout_VexGuestPPC32State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestPPC32State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestPPC32State>(),
        1952usize,
        concat!("Size of: ", stringify!(VexGuestPPC32State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestPPC32State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestPPC32State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad3) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad4) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR3) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR4) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR5) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR6) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR7) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR8) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR9) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR10) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR11) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR12) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR13) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR14) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR15) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR16) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR17) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR18) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR19) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR20) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR21) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR22) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR23) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR24) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR25) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR26) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR27) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR28) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR29) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR30) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR31) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_GPR31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR0) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR1) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR2) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR3) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR4) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR5) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR6) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR7) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR8) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR9) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR10) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR11) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR12) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR13) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR14) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR15) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR16) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR17) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR18) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR19) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR20) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR21) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR22) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR23) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR24) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR25) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR26) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR27) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR28) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR29) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR30) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR31) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR32) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR33) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR33)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR34) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR34)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR35) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR35)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR36) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR36)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR37) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR37)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR38) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR38)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR39) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR39)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR40) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR40)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR41) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR41)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR42) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR42)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR43) as usize - ptr as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR43)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR44) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR44)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR45) as usize - ptr as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR45)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR46) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR46)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR47) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR47)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR48) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR48)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR49) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR49)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR50) as usize - ptr as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR50)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR51) as usize - ptr as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR51)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR52) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR52)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR53) as usize - ptr as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR53)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR54) as usize - ptr as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR54)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR55) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR55)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR56) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR56)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR57) as usize - ptr as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR57)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR58) as usize - ptr as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR58)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR59) as usize - ptr as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR59)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR60) as usize - ptr as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR60)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR61) as usize - ptr as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR61)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR62) as usize - ptr as usize },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR62)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR63) as usize - ptr as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSR63)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CIA) as usize - ptr as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CIA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LR) as usize - ptr as usize },
        1172usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_LR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CTR) as usize - ptr as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CTR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_SO) as usize - ptr as usize },
        1180usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_XER_SO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_OV) as usize - ptr as usize },
        1181usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_XER_OV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_OV32) as usize - ptr as usize },
        1182usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_XER_OV32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_CA) as usize - ptr as usize },
        1183usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_XER_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_CA32) as usize - ptr as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_XER_CA32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_BC) as usize - ptr as usize },
        1185usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_XER_BC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR0_321) as usize - ptr as usize },
        1186usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR0_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR0_0) as usize - ptr as usize },
        1187usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR0_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR1_321) as usize - ptr as usize },
        1188usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR1_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR1_0) as usize - ptr as usize },
        1189usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR1_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR2_321) as usize - ptr as usize },
        1190usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR2_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR2_0) as usize - ptr as usize },
        1191usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR2_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR3_321) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR3_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR3_0) as usize - ptr as usize },
        1193usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR3_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR4_321) as usize - ptr as usize },
        1194usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR4_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR4_0) as usize - ptr as usize },
        1195usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR4_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR5_321) as usize - ptr as usize },
        1196usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR5_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR5_0) as usize - ptr as usize },
        1197usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR5_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR6_321) as usize - ptr as usize },
        1198usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR6_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR6_0) as usize - ptr as usize },
        1199usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR6_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR7_321) as usize - ptr as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR7_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR7_0) as usize - ptr as usize },
        1201usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CR7_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPROUND) as usize - ptr as usize },
        1202usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_FPROUND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_DFPROUND) as usize - ptr as usize },
        1203usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_DFPROUND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_C_FPCC) as usize - ptr as usize },
        1204usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_C_FPCC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize },
        1205usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad1) as usize - ptr as usize },
        1206usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad2) as usize - ptr as usize },
        1207usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VRSAVE) as usize - ptr as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VRSAVE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSCR) as usize - ptr as usize },
        1212usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_VSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        1220usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        1224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        1228usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR_GPR2) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_NRADDR_GPR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_REDIR_SP) as usize - ptr as usize },
        1236usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_REDIR_SP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_REDIR_STACK) as usize - ptr as usize },
        1240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_REDIR_STACK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IP_AT_SYSCALL) as usize - ptr as usize },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_IP_AT_SYSCALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_SPRG3_RO) as usize - ptr as usize },
        1372usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_SPRG3_RO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding1) as usize - ptr as usize },
        1376usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(padding1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TFHAR) as usize - ptr as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_TFHAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TEXASR) as usize - ptr as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_TEXASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TFIAR) as usize - ptr as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_TFIAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PPR) as usize - ptr as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_PPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TEXASRU) as usize - ptr as usize },
        1416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_TEXASRU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PSPB) as usize - ptr as usize },
        1420usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_PSPB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_DSCR) as usize - ptr as usize },
        1424usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_DSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r0) as usize - ptr as usize },
        1432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_0_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r1) as usize - ptr as usize },
        1448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_0_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r2) as usize - ptr as usize },
        1464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_0_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r3) as usize - ptr as usize },
        1480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_0_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r0) as usize - ptr as usize },
        1496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_1_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r1) as usize - ptr as usize },
        1512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_1_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r2) as usize - ptr as usize },
        1528usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_1_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r3) as usize - ptr as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_1_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r0) as usize - ptr as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_2_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r1) as usize - ptr as usize },
        1576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_2_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r2) as usize - ptr as usize },
        1592usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_2_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r3) as usize - ptr as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_2_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r0) as usize - ptr as usize },
        1624usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_3_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r1) as usize - ptr as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_3_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r2) as usize - ptr as usize },
        1656usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_3_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r3) as usize - ptr as usize },
        1672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_3_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r0) as usize - ptr as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_4_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r1) as usize - ptr as usize },
        1704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_4_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r2) as usize - ptr as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_4_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r3) as usize - ptr as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_4_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r0) as usize - ptr as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_5_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r1) as usize - ptr as usize },
        1768usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_5_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r2) as usize - ptr as usize },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_5_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r3) as usize - ptr as usize },
        1800usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_5_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r0) as usize - ptr as usize },
        1816usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_6_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r1) as usize - ptr as usize },
        1832usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_6_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r2) as usize - ptr as usize },
        1848usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_6_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r3) as usize - ptr as usize },
        1864usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_6_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r0) as usize - ptr as usize },
        1880usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_7_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r1) as usize - ptr as usize },
        1896usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_7_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r2) as usize - ptr as usize },
        1912usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_7_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r3) as usize - ptr as usize },
        1928usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(guest_ACC_7_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding2) as usize - ptr as usize },
        1944usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC32State),
            "::",
            stringify!(padding2)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestPPC32_initialise(vex_state: *mut VexGuestPPC32State);
}
extern "C" {
    pub fn LibVEX_GuestPPC32_put_CR(cr_native: UInt, vex_state: *mut VexGuestPPC32State);
}
extern "C" {
    pub fn LibVEX_GuestPPC32_get_CR(vex_state: *const VexGuestPPC32State) -> UInt;
}
extern "C" {
    pub fn LibVEX_GuestPPC32_put_XER(xer_native: UInt, vex_state: *mut VexGuestPPC32State);
}
extern "C" {
    pub fn LibVEX_GuestPPC32_get_XER(vex_state: *const VexGuestPPC32State) -> UInt;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VexGuestPPC64State {
    pub host_EvC_FAILADDR: ULong,
    pub host_EvC_COUNTER: UInt,
    pub pad0: UInt,
    pub guest_GPR0: ULong,
    pub guest_GPR1: ULong,
    pub guest_GPR2: ULong,
    pub guest_GPR3: ULong,
    pub guest_GPR4: ULong,
    pub guest_GPR5: ULong,
    pub guest_GPR6: ULong,
    pub guest_GPR7: ULong,
    pub guest_GPR8: ULong,
    pub guest_GPR9: ULong,
    pub guest_GPR10: ULong,
    pub guest_GPR11: ULong,
    pub guest_GPR12: ULong,
    pub guest_GPR13: ULong,
    pub guest_GPR14: ULong,
    pub guest_GPR15: ULong,
    pub guest_GPR16: ULong,
    pub guest_GPR17: ULong,
    pub guest_GPR18: ULong,
    pub guest_GPR19: ULong,
    pub guest_GPR20: ULong,
    pub guest_GPR21: ULong,
    pub guest_GPR22: ULong,
    pub guest_GPR23: ULong,
    pub guest_GPR24: ULong,
    pub guest_GPR25: ULong,
    pub guest_GPR26: ULong,
    pub guest_GPR27: ULong,
    pub guest_GPR28: ULong,
    pub guest_GPR29: ULong,
    pub guest_GPR30: ULong,
    pub guest_GPR31: ULong,
    pub guest_VSR0: U128,
    pub guest_VSR1: U128,
    pub guest_VSR2: U128,
    pub guest_VSR3: U128,
    pub guest_VSR4: U128,
    pub guest_VSR5: U128,
    pub guest_VSR6: U128,
    pub guest_VSR7: U128,
    pub guest_VSR8: U128,
    pub guest_VSR9: U128,
    pub guest_VSR10: U128,
    pub guest_VSR11: U128,
    pub guest_VSR12: U128,
    pub guest_VSR13: U128,
    pub guest_VSR14: U128,
    pub guest_VSR15: U128,
    pub guest_VSR16: U128,
    pub guest_VSR17: U128,
    pub guest_VSR18: U128,
    pub guest_VSR19: U128,
    pub guest_VSR20: U128,
    pub guest_VSR21: U128,
    pub guest_VSR22: U128,
    pub guest_VSR23: U128,
    pub guest_VSR24: U128,
    pub guest_VSR25: U128,
    pub guest_VSR26: U128,
    pub guest_VSR27: U128,
    pub guest_VSR28: U128,
    pub guest_VSR29: U128,
    pub guest_VSR30: U128,
    pub guest_VSR31: U128,
    pub guest_VSR32: U128,
    pub guest_VSR33: U128,
    pub guest_VSR34: U128,
    pub guest_VSR35: U128,
    pub guest_VSR36: U128,
    pub guest_VSR37: U128,
    pub guest_VSR38: U128,
    pub guest_VSR39: U128,
    pub guest_VSR40: U128,
    pub guest_VSR41: U128,
    pub guest_VSR42: U128,
    pub guest_VSR43: U128,
    pub guest_VSR44: U128,
    pub guest_VSR45: U128,
    pub guest_VSR46: U128,
    pub guest_VSR47: U128,
    pub guest_VSR48: U128,
    pub guest_VSR49: U128,
    pub guest_VSR50: U128,
    pub guest_VSR51: U128,
    pub guest_VSR52: U128,
    pub guest_VSR53: U128,
    pub guest_VSR54: U128,
    pub guest_VSR55: U128,
    pub guest_VSR56: U128,
    pub guest_VSR57: U128,
    pub guest_VSR58: U128,
    pub guest_VSR59: U128,
    pub guest_VSR60: U128,
    pub guest_VSR61: U128,
    pub guest_VSR62: U128,
    pub guest_VSR63: U128,
    pub guest_CIA: ULong,
    pub guest_LR: ULong,
    pub guest_CTR: ULong,
    pub guest_XER_SO: UChar,
    pub guest_XER_OV: UChar,
    pub guest_XER_OV32: UChar,
    pub guest_XER_CA: UChar,
    pub guest_XER_CA32: UChar,
    pub guest_XER_BC: UChar,
    pub guest_CR0_321: UChar,
    pub guest_CR0_0: UChar,
    pub guest_CR1_321: UChar,
    pub guest_CR1_0: UChar,
    pub guest_CR2_321: UChar,
    pub guest_CR2_0: UChar,
    pub guest_CR3_321: UChar,
    pub guest_CR3_0: UChar,
    pub guest_CR4_321: UChar,
    pub guest_CR4_0: UChar,
    pub guest_CR5_321: UChar,
    pub guest_CR5_0: UChar,
    pub guest_CR6_321: UChar,
    pub guest_CR6_0: UChar,
    pub guest_CR7_321: UChar,
    pub guest_CR7_0: UChar,
    pub guest_FPROUND: UChar,
    pub guest_DFPROUND: UChar,
    pub guest_C_FPCC: UChar,
    pub pad2: UChar,
    pub pad3: UChar,
    pub pad4: UChar,
    pub guest_VRSAVE: UInt,
    pub guest_VSCR: UInt,
    pub guest_EMNOTE: UInt,
    pub padding: UInt,
    pub guest_CMSTART: ULong,
    pub guest_CMLEN: ULong,
    pub guest_NRADDR: ULong,
    pub guest_NRADDR_GPR2: ULong,
    pub guest_REDIR_SP: ULong,
    pub guest_REDIR_STACK: [ULong; 32usize],
    pub guest_IP_AT_SYSCALL: ULong,
    pub guest_SPRG3_RO: ULong,
    pub guest_TFHAR: ULong,
    pub guest_TEXASR: ULong,
    pub guest_TFIAR: ULong,
    pub guest_PPR: ULong,
    pub guest_TEXASRU: UInt,
    pub guest_PSPB: UInt,
    pub guest_DSCR: ULong,
    pub guest_ACC_0_r0: U128,
    pub guest_ACC_0_r1: U128,
    pub guest_ACC_0_r2: U128,
    pub guest_ACC_0_r3: U128,
    pub guest_ACC_1_r0: U128,
    pub guest_ACC_1_r1: U128,
    pub guest_ACC_1_r2: U128,
    pub guest_ACC_1_r3: U128,
    pub guest_ACC_2_r0: U128,
    pub guest_ACC_2_r1: U128,
    pub guest_ACC_2_r2: U128,
    pub guest_ACC_2_r3: U128,
    pub guest_ACC_3_r0: U128,
    pub guest_ACC_3_r1: U128,
    pub guest_ACC_3_r2: U128,
    pub guest_ACC_3_r3: U128,
    pub guest_ACC_4_r0: U128,
    pub guest_ACC_4_r1: U128,
    pub guest_ACC_4_r2: U128,
    pub guest_ACC_4_r3: U128,
    pub guest_ACC_5_r0: U128,
    pub guest_ACC_5_r1: U128,
    pub guest_ACC_5_r2: U128,
    pub guest_ACC_5_r3: U128,
    pub guest_ACC_6_r0: U128,
    pub guest_ACC_6_r1: U128,
    pub guest_ACC_6_r2: U128,
    pub guest_ACC_6_r3: U128,
    pub guest_ACC_7_r0: U128,
    pub guest_ACC_7_r1: U128,
    pub guest_ACC_7_r2: U128,
    pub guest_ACC_7_r3: U128,
}
#[test]
fn bindgen_test_layout_VexGuestPPC64State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestPPC64State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestPPC64State>(),
        2240usize,
        concat!("Size of: ", stringify!(VexGuestPPC64State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestPPC64State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestPPC64State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad0) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR3) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR4) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR5) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR6) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR7) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR8) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR9) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR10) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR11) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR12) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR13) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR14) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR15) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR16) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR17) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR18) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR19) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR20) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR21) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR22) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR23) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR24) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR25) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR26) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR27) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR28) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR29) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR30) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_GPR31) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_GPR31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR0) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR1) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR2) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR3) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR4) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR5) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR6) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR7) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR8) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR9) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR10) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR11) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR12) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR13) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR14) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR15) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR16) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR17) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR18) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR19) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR20) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR21) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR22) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR23) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR24) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR25) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR26) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR27) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR28) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR29) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR30) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR31) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR32) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR33) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR33)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR34) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR34)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR35) as usize - ptr as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR35)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR36) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR36)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR37) as usize - ptr as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR37)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR38) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR38)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR39) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR39)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR40) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR40)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR41) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR41)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR42) as usize - ptr as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR42)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR43) as usize - ptr as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR43)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR44) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR44)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR45) as usize - ptr as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR45)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR46) as usize - ptr as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR46)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR47) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR47)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR48) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR48)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR49) as usize - ptr as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR49)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR50) as usize - ptr as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR50)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR51) as usize - ptr as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR51)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR52) as usize - ptr as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR52)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR53) as usize - ptr as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR53)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR54) as usize - ptr as usize },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR54)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR55) as usize - ptr as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR55)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR56) as usize - ptr as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR56)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR57) as usize - ptr as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR57)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR58) as usize - ptr as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR58)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR59) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR59)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR60) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR60)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR61) as usize - ptr as usize },
        1248usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR61)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR62) as usize - ptr as usize },
        1264usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR62)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSR63) as usize - ptr as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSR63)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CIA) as usize - ptr as usize },
        1296usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CIA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_LR) as usize - ptr as usize },
        1304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_LR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CTR) as usize - ptr as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CTR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_SO) as usize - ptr as usize },
        1320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_XER_SO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_OV) as usize - ptr as usize },
        1321usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_XER_OV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_OV32) as usize - ptr as usize },
        1322usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_XER_OV32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_CA) as usize - ptr as usize },
        1323usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_XER_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_CA32) as usize - ptr as usize },
        1324usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_XER_CA32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_XER_BC) as usize - ptr as usize },
        1325usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_XER_BC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR0_321) as usize - ptr as usize },
        1326usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR0_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR0_0) as usize - ptr as usize },
        1327usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR0_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR1_321) as usize - ptr as usize },
        1328usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR1_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR1_0) as usize - ptr as usize },
        1329usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR1_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR2_321) as usize - ptr as usize },
        1330usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR2_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR2_0) as usize - ptr as usize },
        1331usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR2_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR3_321) as usize - ptr as usize },
        1332usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR3_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR3_0) as usize - ptr as usize },
        1333usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR3_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR4_321) as usize - ptr as usize },
        1334usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR4_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR4_0) as usize - ptr as usize },
        1335usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR4_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR5_321) as usize - ptr as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR5_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR5_0) as usize - ptr as usize },
        1337usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR5_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR6_321) as usize - ptr as usize },
        1338usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR6_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR6_0) as usize - ptr as usize },
        1339usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR6_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR7_321) as usize - ptr as usize },
        1340usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR7_321)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CR7_0) as usize - ptr as usize },
        1341usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CR7_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_FPROUND) as usize - ptr as usize },
        1342usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_FPROUND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_DFPROUND) as usize - ptr as usize },
        1343usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_DFPROUND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_C_FPCC) as usize - ptr as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_C_FPCC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad2) as usize - ptr as usize },
        1345usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad3) as usize - ptr as usize },
        1346usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad4) as usize - ptr as usize },
        1347usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VRSAVE) as usize - ptr as usize },
        1348usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VRSAVE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_VSCR) as usize - ptr as usize },
        1352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_VSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        1356usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        1360usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        1376usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR_GPR2) as usize - ptr as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_NRADDR_GPR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_REDIR_SP) as usize - ptr as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_REDIR_SP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_REDIR_STACK) as usize - ptr as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_REDIR_STACK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IP_AT_SYSCALL) as usize - ptr as usize },
        1664usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_IP_AT_SYSCALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_SPRG3_RO) as usize - ptr as usize },
        1672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_SPRG3_RO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TFHAR) as usize - ptr as usize },
        1680usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_TFHAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TEXASR) as usize - ptr as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_TEXASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TFIAR) as usize - ptr as usize },
        1696usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_TFIAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PPR) as usize - ptr as usize },
        1704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_PPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_TEXASRU) as usize - ptr as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_TEXASRU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_PSPB) as usize - ptr as usize },
        1716usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_PSPB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_DSCR) as usize - ptr as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_DSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r0) as usize - ptr as usize },
        1728usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_0_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r1) as usize - ptr as usize },
        1744usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_0_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r2) as usize - ptr as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_0_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_0_r3) as usize - ptr as usize },
        1776usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_0_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r0) as usize - ptr as usize },
        1792usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_1_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r1) as usize - ptr as usize },
        1808usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_1_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r2) as usize - ptr as usize },
        1824usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_1_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_1_r3) as usize - ptr as usize },
        1840usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_1_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r0) as usize - ptr as usize },
        1856usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_2_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r1) as usize - ptr as usize },
        1872usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_2_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r2) as usize - ptr as usize },
        1888usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_2_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_2_r3) as usize - ptr as usize },
        1904usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_2_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r0) as usize - ptr as usize },
        1920usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_3_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r1) as usize - ptr as usize },
        1936usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_3_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r2) as usize - ptr as usize },
        1952usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_3_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_3_r3) as usize - ptr as usize },
        1968usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_3_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r0) as usize - ptr as usize },
        1984usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_4_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r1) as usize - ptr as usize },
        2000usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_4_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r2) as usize - ptr as usize },
        2016usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_4_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_4_r3) as usize - ptr as usize },
        2032usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_4_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r0) as usize - ptr as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_5_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r1) as usize - ptr as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_5_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r2) as usize - ptr as usize },
        2080usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_5_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_5_r3) as usize - ptr as usize },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_5_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r0) as usize - ptr as usize },
        2112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_6_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r1) as usize - ptr as usize },
        2128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_6_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r2) as usize - ptr as usize },
        2144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_6_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_6_r3) as usize - ptr as usize },
        2160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_6_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r0) as usize - ptr as usize },
        2176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_7_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r1) as usize - ptr as usize },
        2192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_7_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r2) as usize - ptr as usize },
        2208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_7_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ACC_7_r3) as usize - ptr as usize },
        2224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestPPC64State),
            "::",
            stringify!(guest_ACC_7_r3)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestPPC64_initialise(vex_state: *mut VexGuestPPC64State);
}
extern "C" {
    pub fn LibVEX_GuestPPC64_put_CR(cr_native: UInt, vex_state: *mut VexGuestPPC64State);
}
extern "C" {
    pub fn LibVEX_GuestPPC64_get_CR(vex_state: *const VexGuestPPC64State) -> UInt;
}
extern "C" {
    pub fn LibVEX_GuestPPC64_put_XER(xer_native: UInt, vex_state: *mut VexGuestPPC64State);
}
extern "C" {
    pub fn LibVEX_GuestPPC64_get_XER(vex_state: *const VexGuestPPC64State) -> UInt;
}
#[repr(C)]
pub struct VexGuestS390XState {
    pub guest_a0: UInt,
    pub guest_a1: UInt,
    pub guest_a2: UInt,
    pub guest_a3: UInt,
    pub guest_a4: UInt,
    pub guest_a5: UInt,
    pub guest_a6: UInt,
    pub guest_a7: UInt,
    pub guest_a8: UInt,
    pub guest_a9: UInt,
    pub guest_a10: UInt,
    pub guest_a11: UInt,
    pub guest_a12: UInt,
    pub guest_a13: UInt,
    pub guest_a14: UInt,
    pub guest_a15: UInt,
    pub guest_v0: V128,
    pub guest_v1: V128,
    pub guest_v2: V128,
    pub guest_v3: V128,
    pub guest_v4: V128,
    pub guest_v5: V128,
    pub guest_v6: V128,
    pub guest_v7: V128,
    pub guest_v8: V128,
    pub guest_v9: V128,
    pub guest_v10: V128,
    pub guest_v11: V128,
    pub guest_v12: V128,
    pub guest_v13: V128,
    pub guest_v14: V128,
    pub guest_v15: V128,
    pub guest_v16: V128,
    pub guest_v17: V128,
    pub guest_v18: V128,
    pub guest_v19: V128,
    pub guest_v20: V128,
    pub guest_v21: V128,
    pub guest_v22: V128,
    pub guest_v23: V128,
    pub guest_v24: V128,
    pub guest_v25: V128,
    pub guest_v26: V128,
    pub guest_v27: V128,
    pub guest_v28: V128,
    pub guest_v29: V128,
    pub guest_v30: V128,
    pub guest_v31: V128,
    pub guest_r0: ULong,
    pub guest_r1: ULong,
    pub guest_r2: ULong,
    pub guest_r3: ULong,
    pub guest_r4: ULong,
    pub guest_r5: ULong,
    pub guest_r6: ULong,
    pub guest_r7: ULong,
    pub guest_r8: ULong,
    pub guest_r9: ULong,
    pub guest_r10: ULong,
    pub guest_r11: ULong,
    pub guest_r12: ULong,
    pub guest_r13: ULong,
    pub guest_r14: ULong,
    pub guest_r15: ULong,
    pub guest_counter: ULong,
    pub guest_fpc: UInt,
    pub unused: [UChar; 4usize],
    pub guest_IA: ULong,
    pub guest_SYSNO: ULong,
    pub guest_CC_OP: ULong,
    pub guest_CC_DEP1: ULong,
    pub guest_CC_DEP2: ULong,
    pub guest_CC_NDEP: ULong,
    pub guest_NRADDR: ULong,
    pub guest_CMSTART: ULong,
    pub guest_CMLEN: ULong,
    pub guest_IP_AT_SYSCALL: ULong,
    pub guest_EMNOTE: UInt,
    pub host_EvC_COUNTER: UInt,
    pub host_EvC_FAILADDR: ULong,
    pub padding: __IncompleteArrayField<UChar>,
}
#[test]
fn bindgen_test_layout_VexGuestS390XState() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestS390XState> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestS390XState>(),
        816usize,
        concat!("Size of: ", stringify!(VexGuestS390XState))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestS390XState>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestS390XState))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a1) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a3) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a4) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a5) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a6) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a7) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a8) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a9) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a10) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a11) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a12) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a13) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a14) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_a15) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_a15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v0) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v1) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v2) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v3) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v4) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v5) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v6) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v7) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v8) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v9) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v10) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v11) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v12) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v13) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v14) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v15) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v16) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v17) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v18) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v18)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v19) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v19)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v20) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v21) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v22) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v23) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v24) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v24)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v25) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v25)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v26) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v26)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v27) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v27)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v28) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v28)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v29) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v29)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v30) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v30)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_v31) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_v31)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r0) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r1) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r2) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r3) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r4) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r5) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r6) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r7) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r8) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r9) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r10) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r11) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r12) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r13) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r14) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_r15) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_r15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_counter) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_fpc) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_fpc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize },
        716usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IA) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_IA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_SYSNO) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_SYSNO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_OP) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_CC_OP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP1) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_CC_DEP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP2) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_CC_DEP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_NDEP) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_CC_NDEP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_NRADDR) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_NRADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMSTART) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_CMSTART)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CMLEN) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_CMLEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_IP_AT_SYSCALL) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_IP_AT_SYSCALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EMNOTE) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(guest_EMNOTE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        804usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestS390XState),
            "::",
            stringify!(padding)
        )
    );
}
extern "C" {
    pub fn LibVEX_GuestS390X_initialise(arg1: *mut VexGuestS390XState);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VexGuestX86State {
    pub host_EvC_FAILADDR: UInt,
    pub host_EvC_COUNTER: UInt,
    pub guest_EAX: UInt,
    pub guest_ECX: UInt,
    pub guest_EDX: UInt,
    pub guest_EBX: UInt,
    pub guest_ESP: UInt,
    pub guest_EBP: UInt,
    pub guest_ESI: UInt,
    pub guest_EDI: UInt,
    pub guest_CC_OP: UInt,
    pub guest_CC_DEP1: UInt,
    pub guest_CC_DEP2: UInt,
    pub guest_CC_NDEP: UInt,
    pub guest_DFLAG: UInt,
    pub guest_IDFLAG: UInt,
    pub guest_ACFLAG: UInt,
    pub guest_EIP: UInt,
    pub guest_FPREG: [ULong; 8usize],
    pub guest_FPTAG: [UChar; 8usize],
    pub guest_FPROUND: UInt,
    pub guest_FC3210: UInt,
    pub guest_FTOP: UInt,
    pub guest_SSEROUND: UInt,
    pub guest_XMM0: U128,
    pub guest_XMM1: U128,
    pub guest_XMM2: U128,
    pub guest_XMM3: U128,
    pub guest_XMM4: U128,
    pub guest_XMM5: U128,
    pub guest_XMM6: U128,
    pub guest_XMM7: U128,
    pub guest_CS: UShort,
    pub guest_DS: UShort,
    pub guest_ES: UShort,
    pub guest_FS: UShort,
    pub guest_GS: UShort,
    pub guest_SS: UShort,
    pub guest_LDT: ULong,
    pub guest_GDT: ULong,
    pub guest_EMNOTE: UInt,
    pub guest_CMSTART: UInt,
    pub guest_CMLEN: UInt,
    pub guest_NRADDR: UInt,
    pub guest_SC_CLASS: UInt,
    pub guest_IP_AT_SYSCALL: UInt,
    pub padding1: UInt,
}
#[test]
fn bindgen_test_layout_VexGuestX86State() {
    const UNINIT: ::std::mem::MaybeUninit<VexGuestX86State> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VexGuestX86State>(),
        352usize,
        concat!("Size of: ", stringify!(VexGuestX86State))
    );
    assert_eq!(
        ::std::mem::align_of::<VexGuestX86State>(),
        8usize,
        concat!("Alignment of ", stringify!(VexGuestX86State))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_FAILADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(host_EvC_FAILADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host_EvC_COUNTER) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(host_EvC_COUNTER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EAX) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_EAX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ECX) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_ECX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EDX) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_EDX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EBX) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_EBX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ESP) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_ESP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EBP) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_EBP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_ESI) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_ESI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_EDI) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_EDI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_OP) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_CC_OP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP1) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_CC_DEP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_DEP2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VexGuestX86State),
            "::",
            stringify!(guest_CC_DEP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guest_CC_NDEP) as usize - ptr as usize },
        52usize,
        concat!(
